SetExprField in V8 using mapFields/caseof2106/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Preload any required fields (optional)
readFields      ( U );

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            centre (0.05 0 0);
            
        }

        variables
        (
            "radius = 0.01"
        );

        condition
        #{
            // Within the radius
            (mag(pos() - $[(vector)constants.centre]) < radius)

            // but only +ve y!
          && pos((pos() - $[(vector)constants.centre]).y()) > 0
        #};

        expression
        #{
            vector
            (
               (13 + 2 * (1 - mag(pos() - $[(vector)constants.centre]) / radius)),
               (13 + 2 * (1 - mag(pos() - $[(vector)constants.centre]) / radius)),
               (0) 
            )
        #};
    }
);


// ************************************************************************* //
