SetExprField in V8 using mapFields/caseof2106/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    
    volVectorFieldValue U (0 0 0)
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)

    // Set patch values (using ==)
    boxToCell
    {
        box (0.1 -0.01 -0.0005) (0.15 0.01 0.0005);

        fieldValues
        (
            volVectorFieldValue U (10 0 0)
        );
    }
    
);

// ************************************************************************* //
